episode-05-optimization-loop/openfoam-template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Domain dimensions
// Heatsink: X[0, 0.06], Y[0, 0.023], Z[0, 0.06]
// Domain:   30mm upstream, 90mm downstream, 30mm on each side, 60mm height

xMin    -0.03;
xMax     0.15;
yMin     0;
yMax     0.06;
zMin    -0.03;
zMax     0.09;

// Background cell size ~3mm
// X: 180mm / 3mm = 60 cells
// Y:  60mm / 3mm = 20 cells
// Z: 120mm / 3mm = 40 cells

vertices
(
    ($xMin $yMin $zMin)   // 0
    ($xMax $yMin $zMin)   // 1
    ($xMax $yMax $zMin)   // 2
    ($xMin $yMax $zMin)   // 3
    ($xMin $yMin $zMax)   // 4
    ($xMax $yMin $zMax)   // 5
    ($xMax $yMax $zMax)   // 6
    ($xMin $yMax $zMax)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 20 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    side_left
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    side_right
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);
