episode-05-optimization-loop/openfoam-template/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   28.96;
    }
    thermodynamics
    {
        Cp          1005;
        Hf          0;
    }
    transport
    {
        mu          1.85e-05;
        Pr          0.71;
    }
    equationOfState
    {
        rho0        1.177;      // density at T0 [kg/m³]
        T0          300;        // reference temperature [K]
        beta        3.33e-03;   // thermal expansion coeff = 1/T0 [1/K]
    }
}
