episode-05-optimization-loop/openfoam-template/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    top
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    "(side_left|side_right)"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    "heatsink.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}
