episode-05-optimization-loop/openfoam-template/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default                                     none;
    div(phi,U)                                  bounded Gauss upwind;
    div(phi,h)                                  bounded Gauss upwind;
    div(phi,K)                                  bounded Gauss upwind;
    div(phi,k)                                  bounded Gauss linearUpwind default;
    div(phi,epsilon)                            bounded Gauss linearUpwind default;
    div(((rho*nuEff)*dev2(T(grad(U)))))         Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
